############################################
"""
     *          #前面的空格：层数-1，层数-2。。。 中间空格：1，3，5。。。
    * *
   *   *
  *     *
 *       *
  *     *       # 前面的空格
   *   *
    * *
     *
"""
# 打印上半部分
n = 9
for i in range(n):
    if i == 0:
        print(' ' * (n-1-i) + '*')
    else:
        s = ' ' * (n-1-i) + '*' + ' '* (2 * i - 1) + '*'
        print(s)

# 打印下半部分
for i in range(n-1):
    if i == n - 2:
        print(' ' * (n - 1)+ '*')
    else:
        s = ' ' * (i + 1) + '*' + ' '* (n * 2 - 5 - 2 * i) + '*'
        print(s)
